In [1]:
%pylab inline
import seaborn as sb
import pandas as pd
filename="E:/lobar/data_science/uber_data_analysis/uber-raw-data-apr14.csv"
data=pd.read_csv(filename)
data.head()

Populating the interactive namespace from numpy and matplotlib

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

In [2]:
dt='4/1/2014 0:11:00'

In [3]:
dt

'4/1/2014 0:11:00'

In [4]:
dt.split(' ')

['4/1/2014', '0:11:00']

In [5]:
date, time=dt.split(' ')

In [6]:
date

'4/1/2014'

In [7]:
d, m, y=date.split('/')

In [8]:
d

'4'

In [10]:
d=pd.to_datetime(date)

In [11]:
d

Timestamp('2014-04-01 00:00:00')

In [15]:
data["Date/Time"]=data["Date/Time"].map(pd.to_datetime)

In [17]:
data["Date/Time"][0]

Timestamp('2014-04-01 00:11:00')

In [20]:
def dom(date):
    return date.day
data['dom']=data['Date/Time'].map(dom)

In [21]:
data.tail()

                 Date/Time      Lat      Lon    Base  dom
564511 2014-04-30 23:22:00  40.7640 -73.9744  B02764   30
564512 2014-04-30 23:26:00  40.7629 -73.9672  B02764   30
564513 2014-04-30 23:31:00  40.7443 -73.9889  B02764   30
564514 2014-04-30 23:32:00  40.6756 -73.9405  B02764   30
564515 2014-04-30 23:48:00  40.6880 -73.9608  B02764   30

In [35]:
def get_weekday(date):
    return date.weekday()

In [36]:
data['weekday']=data["Date/Time"].map(get_weekday)

In [37]:
def get_hour(date):
    return date.hour

In [38]:
data["hour"]=data['Date/Time'].map(get_hour)

In [39]:
data.tail()

                 Date/Time      Lat      Lon    Base  dom  weekday  hour
564511 2014-04-30 23:22:00  40.7640 -73.9744  B02764   30        2    23
564512 2014-04-30 23:26:00  40.7629 -73.9672  B02764   30        2    23
564513 2014-04-30 23:31:00  40.7443 -73.9889  B02764   30        2    23
564514 2014-04-30 23:32:00  40.6756 -73.9405  B02764   30        2    23
564515 2014-04-30 23:48:00  40.6880 -73.9608  B02764   30        2    23

In [41]:
data["weekday"]

0         1
1         1
2         1
3         1
4         1
         ..
564511    2
564512    2
564513    2
564514    2
564515    2
Name: weekday, Length: 564516, dtype: int64